<template>
	<view class="lawCard">
		<view v-for="(item,index) in lawArray">
			{{item}}
		</view>
	</view>
</template>

<script>
	import {
		basisConfig
	} from '@/network/apiFunction.js'
	export default {
		data() {
			return {
				lawArray: []
			}
		},
		onLoad() {



			basisConfig().then(res => {
				if (res.code == 1) {

					let title
					title = res.data.company_title
					let startArray = [
						"第一条  " + title +
						"的宗旨是在不违反中华人民共和国法律法规的前提下，尽可能地为中国广大投资者提供专业的国际化水准的交易平台和金融产品。禁止使用" + title +
						"从事洗钱、 走私、 商业贿赂等一切非法交易活动， 若发现此类事件， 本站将冻结账户， 立即报送公安机关。",
						"第二条  当公安机关、检察院、法院等有权机关出示相应的调查文件要求本站配合对指定用户进行调查时， 或对用户账户采取查封、冻结或者划转措施时，本站将按照公安机关的要求协助提供相应的用户数据，或进行相应的操作。 因此而造成的用户隐私泄露、账户不能操作及因此给所造成的损失等，本站不承担任何责任。",
						"第三条 " + title +
						"使用者因为违反本声明的规定而触犯中华人民共和国法律的，本站做为服务的提供方，有义务对平台的规则及服务进行完善， 但本站并无触犯中华人民共和国法律的动机和事实，对使用者的行为不承担任何连带责任。",
						"第四条  凡以任何方式登陆" + title + "或直接、间接使用测试服务者，视为自愿接受测试声明的约束。测试认为，一切参与" + title +
						"的用户在进入本网主页及各层页面时已经仔细看过本免责条款并完全同意。",
						"第五条 " + title + "所刊载的所有资料及图表仅供参考使用。投资者如根据站内文章、图片、视频等内容进行投资，风险自负，" + title +
						"不负任何盈亏责任。",
						"第六条  由于用户将个人密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露，" + title +
						"不负任何责任。任何由于黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营的不可抗力而造成的个人资料泄露、丢失、被盗用或被窜改等，" +
						title + "及时采取补救措施后，" + title + "均得免责。",
						"第七条  " + title +
						"如因系统维护或升级而需暂停服务，或因线路及非本公司控制范围外的硬件故障或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，" + title +
						"不负任何责任。",
						"第八条  本声明未涉及的问题参见中华人民共和国有关法律法规，当本声明与中华人民共和国法律法规冲突时，以中华人民共和国法律法规为准。",
						"第九条 " + title + "之声明以及其修改权、更新权及最终解释权均属本公司"
					]
					this.lawArray = startArray
				}
			})
		}
	}
</script>

<style>
	.lawCard {
		color: #8f8f94;
		font-size: 25rpx;
		padding: 20rpx 40rpx;
	}

	.lawCard>view {
		margin: 25rpx 0;
	}
</style>
